bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY441.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant name="ATtiny441-SSU" package="SOIC14" pinout="SOIC_14" speedmax="16000000" tempmax="85" tempmin="-40" vccmax="5.5" vccmin="1.7"/>
        <variant name="ATtiny441-MU" package="MLF20" pinout="QFN_20" speedmax="16000000" tempmax="85" tempmin="-40" vccmax="5.5" vccmin="1.7"/>
        <variant name="ATtiny441-MMH" package="VQFN20" pinout="QFN_20" speedmax="16000000" tempmax="85" tempmin="-40" vccmax="5.5" vccmin="1.7"/>
    </variants>
    <device name="ATtiny441" family="AVR8" architecture="AVR8" avr-family="tinyAVR">
        <address-spaces>
            <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x1000">
                <memory-segment start="0x0000" size="0x1000" type="flash" rw="RW" exec="1" name="FLASH" pagesize="0x10"/>
            </address-space>
            <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
            </address-space>
            <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
                <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
            </address-space>
            <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
            </address-space>
            <address-space endianness="little" name="data" id="data" start="0x0000" size="0x0300">
                <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                <memory-segment name="MAPPED_IO" start="0x0020" size="0x00e0" type="io" external="false"/>
                <memory-segment name="IRAM" start="0x0100" size="0x0100" type="ram" external="false"/>
            </address-space>
            <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0100">
                <memory-segment start="0x0000" size="0x0100" type="eeprom" rw="RW" exec="0" name="EEPROM" pagesize="0x04"/>
            </address-space>
            <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
            <address-space endianness="little" name="osccal" id="osccal" start="0" size="2">
                <memory-segment start="0" size="2" type="osccal" rw="R" exec="0" name="OSCCAL"/>
            </address-space>
        </address-spaces>
        <peripherals>
            <module name="PORT">
                <instance name="PORTB" caption="I/O Port">
                    <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal function="PORTB" group="P" index="0" pad="PB0"/>
                        <signal function="PORTB" group="P" index="1" pad="PB1"/>
                        <signal function="PORTB" group="P" index="2" pad="PB2"/>
                        <signal function="PORTB" group="P" index="3" pad="PB3"/>
                    </signals>
                </instance>
                <instance name="PORTA" caption="I/O Port">
                    <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal function="PORTA" group="P" index="0" pad="PA0"/>
                        <signal function="PORTA" group="P" index="1" pad="PA1"/>
                        <signal function="PORTA" group="P" index="2" pad="PA2"/>
                        <signal function="PORTA" group="P" index="3" pad="PA3"/>
                        <signal function="PORTA" group="P" index="4" pad="PA4"/>
                        <signal function="PORTA" group="P" index="5" pad="PA5"/>
                        <signal function="PORTA" group="P" index="6" pad="PA6"/>
                        <signal function="PORTA" group="P" index="7" pad="PA7"/>
                    </signals>
                </instance>
            </module>
            <module name="USART">
                <instance name="USART1" caption="USART">
                    <register-group name="USART1" name-in-module="USART1" offset="0x00" address-space="data" caption="USART"/>
                    <signals>
                        <signal function="USART" group="RXD" pad="PA4"/>
                        <signal function="USART" group="TXD" pad="PA5"/>
                        <signal function="USART" group="XCK" pad="PA6"/>
                    </signals>
                </instance>
                <instance name="USART0" caption="USART">
                    <register-group name="USART0" name-in-module="USART0" offset="0x00" address-space="data" caption="USART"/>
                    <signals>
                        <signal field="U0MAP" function="USART" group="TXD" pad="PA1"/>
                        <signal field="U0MAP" function="USART" group="RXD" pad="PA2"/>
                        <signal field="U0MAP" function="USART" group="XCK" pad="PA3"/>
                        <signal field="U0MAP" function="USART_ALT" group="TXD" pad="PA7"/>
                        <signal field="U0MAP" function="USART_ALT" group="RXD" pad="PB2"/>
                        <signal field="U0MAP" function="USART_ALT" group="XCK" pad="PA3"/>
                    </signals>
                </instance>
            </module>
            <module name="WDT">
                <instance name="WDT" caption="Watchdog Timer">
                    <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data" caption="Watchdog Timer"/>
                </instance>
            </module>
            <module name="TWI">
                <instance name="TWI" caption="Two Wire Serial Interface">
                    <register-group name="TWI" name-in-module="TWI" offset="0x00" address-space="data" caption="Two Wire Serial Interface"/>
                    <signals>
                        <signal function="TWI" group="SCL" pad="PA4"/>
                        <signal function="TWI" group="SDA" pad="PA6"/>
                    </signals>
                </instance>
            </module>
            <module name="ADC">
                <instance name="ADC" caption="Analog-to-Digital Converter">
                    <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data" caption="Analog-to-Digital Converter"/>
                    <signals>
                        <signal function="ADC" group="ADC" index="0" pad="PA0"/>
                        <signal function="ADC" group="ADC" index="1" pad="PA1"/>
                        <signal function="ADC" group="ADC" index="2" pad="PA2"/>
                        <signal function="ADC" group="ADC" index="3" pad="PA3"/>
                        <signal function="ADC" group="ADC" index="4" pad="PA4"/>
                        <signal function="ADC" group="ADC" index="5" pad="PA5"/>
                        <signal function="ADC" group="ADC" index="6" pad="PA6"/>
                        <signal function="ADC" group="ADC" index="7" pad="PA7"/>
                        <signal function="ADC" group="ADC" index="8" pad="PB2"/>
                        <signal function="ADC" group="ADC" index="9" pad="PB3"/>
                        <signal function="ADC" group="ADC" index="10" pad="PB0"/>
                        <signal function="ADC" group="ADC" index="11" pad="PB1"/>
                        <signal function="AREF" group="AREF" pad="PA0"/>
                    </signals>
                </instance>
            </module>
            <module name="AC">
                <instance name="AC" caption="Analog Comparator">
                    <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data" caption="Analog Comparator"/>
                    <signals>
                        <signal function="ACIN0" group="AIN0" index="0" pad="PA1"/>
                        <signal function="ACIN0" group="AIN0" index="1" pad="PA2"/>
                        <signal function="ACOUT" group="ACO0" pad="PA5"/>
                        <signal function="ACOUT" group="ACO1" pad="PA6"/>
                        <signal function="ACIN1" group="AIN1" index="0" pad="PA3"/>
                        <signal function="ACIN1" group="AIN1" index="1" pad="PA4"/>
                    </signals>
                </instance>
            </module>
            <module name="EEPROM">
                <instance name="EEPROM" caption="EEPROM">
                    <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
