bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY441.xml
                </instance>
            </module>
            <module name="TC16">
                <instance name="TC1" caption="Timer/Counter, 16-bit">
                    <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
                    <signals>
                        <signal function="OC" group="TOCC" index="0" pad="PA1"/>
                        <signal function="OC" group="TOCC" index="1" pad="PA2"/>
                        <signal function="OC" group="TOCC" index="2" pad="PA3"/>
                        <signal function="OC" group="TOCC" index="3" pad="PA4"/>
                        <signal function="OC" group="TOCC" index="4" pad="PA5"/>
                        <signal function="OC" group="TOCC" index="5" pad="PA6"/>
                        <signal function="OC" group="TOCC" index="6" pad="PA7"/>
                        <signal function="OC" group="TOCC" index="7" pad="PB2"/>
                        <signal function="CS" group="T0" pad="PA3"/>
                        <signal function="CS" group="T1" pad="PA4"/>
                        <signal function="CS" group="T2" pad="PA5"/>
                        <signal function="ICP" group="ICP1" pad="PA7"/>
                    </signals>
                </instance>
                <instance name="TC2" caption="Timer/Counter, 16-bit">
                    <register-group name="TC2" name-in-module="TC2" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
                    <signals>
                        <signal function="OC" group="TOCC" index="0" pad="PA1"/>
                        <signal function="OC" group="TOCC" index="1" pad="PA2"/>
                        <signal function="OC" group="TOCC" index="2" pad="PA3"/>
                        <signal function="OC" group="TOCC" index="3" pad="PA4"/>
                        <signal function="OC" group="TOCC" index="4" pad="PA5"/>
                        <signal function="OC" group="TOCC" index="5" pad="PA6"/>
                        <signal function="OC" group="TOCC" index="6" pad="PA7"/>
                        <signal function="OC" group="TOCC" index="7" pad="PB2"/>
                        <signal function="CS" group="T0" pad="PA3"/>
                        <signal function="CS" group="T1" pad="PA4"/>
                        <signal function="CS" group="T2" pad="PA5"/>
                        <signal function="ICP" group="ICP2" pad="PB2"/>
                    </signals>
                </instance>
            </module>
            <module name="TC8">
                <instance name="TC0" caption="Timer/Counter, 8-bit">
                    <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit"/>
                    <signals>
                        <signal function="OC" group="TOCC" index="0" pad="PA1"/>
                        <signal function="OC" group="TOCC" index="0" pad="PA2"/>
                        <signal function="OC" group="TOCC" index="0" pad="PA3"/>
                        <signal function="OC" group="TOCC" index="0" pad="PA4"/>
                        <signal function="OC" group="TOCC" index="0" pad="PA5"/>
                        <signal function="OC" group="TOCC" index="0" pad="PA6"/>
                        <signal function="OC" group="TOCC" index="0" pad="PA7"/>
                        <signal function="OC" group="TOCC" index="0" pad="PB2"/>
                        <signal function="CS" group="T0" pad="PA3"/>
                        <signal function="CS" group="T1" pad="PA4"/>
                        <signal function="CS" group="T2" pad="PA5"/>
                    </signals>
                </instance>
            </module>
            <module name="EXINT">
                <instance name="EXINT" caption="External Interrupts">
                    <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
                    <signals>
                        <signal function="EXTINT" group="PCINT" index="0" pad="PA0"/>
                        <signal function="EXTINT" group="PCINT" index="1" pad="PA1"/>
                        <signal function="EXTINT" group="PCINT" index="2" pad="PA2"/>
                        <signal function="EXTINT" group="PCINT" index="3" pad="PA3"/>
                        <signal function="EXTINT" group="PCINT" index="4" pad="PA4"/>
                        <signal function="EXTINT" group="PCINT" index="5" pad="PA5"/>
                        <signal function="EXTINT" group="PCINT" index="6" pad="PA6"/>
                        <signal function="EXTINT" group="PCINT" index="7" pad="PA7"/>
                        <signal function="EXTINT" group="PCINT" index="8" pad="PB0"/>
                        <signal function="EXTINT" group="PCINT" index="9" pad="PB1"/>
                        <signal function="EXTINT" group="PCINT" index="10" pad="PB2"/>
                        <signal function="EXTINT" group="PCINT" index="11" pad="PB3"/>
                        <signal function="EXTINT" group="INT" index="0" pad="PB1"/>
                    </signals>
                </instance>
            </module>
            <module name="CPU">
                <instance name="CPU" caption="CPU Registers">
                    <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data" caption="CPU Registers"/>
                    <parameters>
                        <param name="CORE_VERSION" value="V2"/>
                        <param name="NEW_INSTRUCTIONS" value="lpm rd,z+"/>
                    </parameters>
                </instance>
            </module>
            <module name="TOCPM">
                <instance name="TOCPM" caption="Timer/Counter Output Compare Pin">
                    <register-group name="TOCPM" name-in-module="TOCPM" offset="0x00" address-space="data" caption="Timer/Counter Output Compare Pin"/>
                </instance>
            </module>
            <module name="SPI">
                <instance name="SPI" caption="Serial Peripheral Interface">
                    <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data" caption="Serial Peripheral Interface"/>
                    <signals>
                        <signal field="SPIMAP" function="SPI_ALT" group="MISO" pad="PA0"/>
                        <signal field="SPIMAP" function="SPI_ALT" group="MOSI" pad="PA1"/>
                        <signal field="SPIMAP" function="SPI_ALT" group="SS" pad="PA2"/>
                        <signal field="SPIMAP" function="SPI_ALT" group="SCK" pad="PA3"/>
                        <signal field="SPIMAP" function="SPI" group="SCK" pad="PA4"/>
                        <signal field="SPIMAP" function="SPI" group="MISO" pad="PA5"/>
                        <signal field="SPIMAP" function="SPI" group="MOSI" pad="PA6"/>
                        <signal field="SPIMAP" function="SPI" group="SS" pad="PA7"/>
                    </signals>
                </instance>
            </module>
            <module name="FUSE">
                <instance name="FUSE" caption="Fuses">
                    <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses" caption="Fuses"/>
