bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY441.xml
                <register caption="" name="LOW" offset="0x00" size="1" initval="0x62">
                    <bitfield caption="Divide clock by 8 internally" mask="0x80" name="CKDIV8"/>
                    <bitfield caption="Clock output on PORTC2" mask="0x40" name="CKOUT"/>
                    <bitfield caption="Select Clock Source" mask="0x1F" name="SUT_CKSEL" values="ENUM_SUT_CKSEL"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_SUT_CKSEL">
                <value caption="Ext. Clock; Start-up time PWRDWN/RESET: 6 CK/16 CK + 16 ms" name="EXTCLK_6CK_16CK_16MS" value="0x00"/>
                <value caption="Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/16 CK + 16 ms" name="INTRCOSC_8MHZ_6CK_16CK_16MS" value="0x02"/>
                <value caption="Int. ULP Osc.; Start-up time PWRDWN/RESET: 6 CK/16 CK + 16 ms" name="INTULPOSC_32KHZ_6CK_16CK_16MS" value="0x04"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time PWRDWN/RESET: 1K CK/16 CK + 16 ms" name="EXTLOFXTAL_1KCK_16CK_16MS" value="0x06"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time PWRDWN/RESET: 32K CK/16 CK + 16 ms" name="EXTLOFXTAL_32KCK_14CK_16MS" value="0x16"/>
                <value caption="Ext. Ceramic Res. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 258 CK/16 CK + 16 ms" name="EXTCRES_0MHZ4_0MHZ9_258CK_16CK_16MS" value="0x08"/>
                <value caption="Ext. Ceramic Res. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 1K CK/16 CK + 16 ms" name="EXTCRES_0MHZ4_0MHZ9_1KCK_16CK_16MS" value="0x18"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 16 K CK/16 CK + 16 ms" name="EXTXOSC_0MHZ4_0MHZ9_16KCK_16CK_16MS" value="0x09"/>
                <value caption="Ext. Ceramic Res. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 258 CK/16 CK + 16 ms" name="EXTCRES_0MHZ9_3MHZ_258CK_16CK_16MS" value="0x0a"/>
                <value caption="Ext. Ceramic Res. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 1K CK/16 CK + 16 ms" name="EXTCRES_0MHZ9_3MHZ_1KCK_16CK_16MS" value="0x1a"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 16 K CK/16 CK + 16 ms" name="EXTXOSC_0MHZ9_3MHZ_16KCK_16CK_16MS" value="0x0b"/>
                <value caption="Ext. Ceramic Res. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 258 CK/16 CK + 16 ms" name="EXTCRES_3MHZ_8MHZ_258CK_16CK_16MS" value="0x0c"/>
                <value caption="Ext. Ceramic Res. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 1K CK/16 CK + 16 ms" name="EXTCRES_3MHZ_8MHZ_1KCK_16CK_16MS" value="0x1c"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 16 K CK/16 CK + 16 ms" name="EXTXOSC_3MHZ_8MHZ_16KCK_16CK_16MS" value="0x0d"/>
                <value caption="Ext. Ceramic Res. 8.0- MHz; Start-up time PWRDWN/RESET: 258 CK/16 CK + 16 ms" name="EXTCRES_8MHZ_XX_258CK_16CK_16MS" value="0x0e"/>
                <value caption="Ext. Ceramic Res. 8.0- MHz; Start-up time PWRDWN/RESET: 1K CK/16 CK + 16 ms" name="EXTCRES_8MHZ_XX_1KCK_16CK_16MS" value="0x1e"/>
                <value caption="Ext. Crystal Osc. 8.0- MHz; Start-up time PWRDWN/RESET: 16 K CK/16 CK + 16 ms" name="EXTXOSC_8MHZ_XX_16KCK_16CK_16MS" value="0x0f"/>
            </value-group>
            <value-group caption="" name="ENUM_BODLEVEL">
                <value caption="Brown-out detection at VCC=4.3 V" name="4V3" value="0x04"/>
                <value caption="Brown-out detection at VCC=2.7 V" name="2V7" value="0x05"/>
                <value caption="Brown-out detection at VCC=1.8 V" name="1V8" value="0x06"/>
            </value-group>
            <value-group caption="" name="ENUM_BODMODE">
                <value caption="Sampled" name="BOD_SAMPLED" value="0x01"/>
                <value caption="Enabled" name="BOD_ENABLED" value="0x02"/>
                <value caption="Disabled" name="BOD_DISABLED" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_ULPOSCSEL">
                <value caption="32 kHz" name="ULPOSC_32KHZ" value="0x07"/>
                <value caption="64 kHz" name="ULPOSC_64KHZ" value="0x06"/>
                <value caption="128 kHz" name="ULPOSC_128KHZ" value="0x05"/>
                <value caption="256 kHz" name="ULPOSC_256KHZ" value="0x04"/>
                <value caption="512 kHz" name="ULPOSC_512KHZ" value="0x03"/>
            </value-group>
        </module>
        <module caption="Lockbits" name="LOCKBIT">
            <register-group caption="Lockbits" name="LOCKBIT">
                <register caption="" name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_LB">
                <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
                <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
                <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
            </value-group>
        </module>
        <module caption="I/O Port" name="PORT">
            <register-group caption="I/O Port" name="PORTB">
                <register caption="Port Control Register" name="PORTCR" offset="0x64" size="1">
                    <bitfield caption="Break-Before-Make Mode Enable" mask="0x02" name="BBMB"/>
                </register>
                <register caption="Pull-up Enable Control Register" name="PUEB" offset="0x62" size="1" mask="0x0F"/>
                <register caption="Data Direction Register, Port B" name="DDRB" offset="0x37" size="1" mask="0x0F"/>
                <register caption="Port B Data register" name="PINB" offset="0x36" size="1" mask="0x0F"/>
                <register caption="Input Pins, Port B" name="PORTB" offset="0x38" size="1" mask="0x0F"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTA">
                <register caption="Port Control Register" name="PORTCR" offset="0x64" size="1">
                    <bitfield caption="Break-Before-Make Mode Enable" mask="0x01" name="BBMA"/>
                </register>
                <register caption="Pull-up Enable Control Register" name="PUEA" offset="0x63" size="1" mask="0xFF"/>
