bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY441.xml
                <register caption="Port A Data Register" name="PORTA" offset="0x3B" size="1" mask="0xFF"/>
                <register caption="Data Direction Register, Port A" name="DDRA" offset="0x3A" size="1" mask="0xFF"/>
                <register caption="Port A Input Pins" name="PINA" offset="0x39" size="1" mask="0xFF"/>
                <register caption="Port High Drive Enable Register" name="PHDE" offset="0x6A" size="1">
                    <bitfield caption="PortA High Drive Enable" mask="0x03" name="PHDEA"/>
                </register>
            </register-group>
        </module>
        <module caption="USART" name="USART">
            <register-group caption="USART" name="USART1">
                <register caption="USART I/O Data Register" name="UDR1" offset="0x90" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART Control and Status Register A" name="UCSR1A" offset="0x96" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC1"/>
                    <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC1"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE1"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE1"/>
                    <bitfield caption="Data overRun" mask="0x08" name="DOR1"/>
                    <bitfield caption="Parity Error" mask="0x04" name="UPE1"/>
                    <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X1"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM1"/>
                </register>
                <register caption="USART Control and Status Register B" name="UCSR1B" offset="0x95" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE1"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE1"/>
                    <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE1"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN1"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN1"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ12"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB81"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB81"/>
                </register>
                <register caption="USART Control and Status Register C" name="UCSR1C" offset="0x94" size="1">
                    <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL1" values="COMM_USART_MODE_2BIT"/>
                    <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM1" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS1" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ1"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL1"/>
                </register>
                <register caption="USART Control and Status Register D" name="UCSR1D" offset="0x93" size="1">
                    <bitfield caption="USART RX Start Interrupt Enable" mask="0x80" name="RXSIE1"/>
                    <bitfield caption="USART RX Start Flag" mask="0x40" name="RXS1"/>
                    <bitfield caption="USART RX Start Frame Detection Enable" mask="0x20" name="SFDE1"/>
                </register>
                <register caption="USART Baud Rate Register Bytes" name="UBRR1" offset="0x91" size="2" mask="0x0FFF"/>
            </register-group>
            <register-group caption="USART" name="USART0">
                <register caption="USART I/O Data Register" name="UDR0" offset="0x80" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART Control and Status Register A" name="UCSR0A" offset="0x86" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC0"/>
                    <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC0"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE0"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE0"/>
                    <bitfield caption="Data overRun" mask="0x08" name="DOR0"/>
                    <bitfield caption="Parity Error" mask="0x04" name="UPE0"/>
                    <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X0"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM0"/>
                </register>
                <register caption="USART Control and Status Register B" name="UCSR0B" offset="0x85" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE0"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE0"/>
                    <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE0"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN0"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN0"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ02"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB80"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB80"/>
                </register>
                <register caption="USART Control and Status Register C" name="UCSR0C" offset="0x84" size="1">
                    <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL0" values="COMM_USART_MODE_2BIT"/>
                    <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM0" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS0" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ0"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL0"/>
                </register>
