bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY441.xml
                <register caption="USART Control and Status Register D" name="UCSR0D" offset="0x83" size="1">
                    <bitfield caption="USART RX Start Interrupt Enable" mask="0x80" name="RXSIE0"/>
                    <bitfield caption="USART RX Start Flag" mask="0x40" name="RXS0"/>
                    <bitfield caption="USART RX Start Frame Detection Enable" mask="0x20" name="SFDE0"/>
                </register>
                <register caption="USART Baud Rate Register Bytes" name="UBRR0" offset="0x81" size="2" mask="0x0FFF"/>
                <register caption="Remap Port Pins" name="REMAP" offset="0x65" size="1">
                    <bitfield caption="USART0 Pin Mapping" mask="0x01" name="U0MAP"/>
                </register>
            </register-group>
            <value-group caption="" name="COMM_USART_MODE_2BIT">
                <value caption="Asynchronous USART" name="VAL_0x00" value="0x00"/>
                <value caption="Synchronous USART" name="VAL_0x01" value="0x01"/>
                <value caption="Master SPI" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_UPM_PARITY_MODE">
                <value caption="Disabled" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
                <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_STOP_BIT_SEL">
                <value caption="1-bit" name="VAL_0x00" value="0x00"/>
                <value caption="2-bit" name="VAL_0x01" value="0x01"/>
            </value-group>
        </module>
        <module caption="Watchdog Timer" name="WDT">
            <register-group caption="Watchdog Timer" name="WDT">
                <register caption="Watchdog Timer Control and Status Register" name="WDTCSR" offset="0x41" size="1">
                    <bitfield caption="Watchdog Timer Interrupt Flag" mask="0x80" name="WDIF"/>
                    <bitfield caption="Watchdog Timer Interrupt Enable" mask="0x40" name="WDIE"/>
                    <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP" values="WDOG_TIMER_PRESCALE_4BITS_32KHZ"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                </register>
            </register-group>
            <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS_32KHZ">
                <value caption="Oscillator Cycles 512 (16 ms)" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 1K (32 ms)" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 2K (64 ms)" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 4K (0.125 s)" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 8K (0.25 s)" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 16K (0.5 s)" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 32K (1.0 s)" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 64K (2.0 s)" name="VAL_0x07" value="0x07"/>
                <value caption="Oscillator Cycles 128K (4.0 s)" name="VAL_0x08" value="0x08"/>
                <value caption="Oscillator Cycles 256K (8.0 s)" name="VAL_0x09" value="0x09"/>
            </value-group>
        </module>
        <module caption="Two Wire Serial Interface" name="TWI">
            <register-group caption="Two Wire Serial Interface" name="TWI">
                <register caption="TWI Slave Control Register A" name="TWSCRA" offset="0xA5" size="1">
                    <bitfield caption="TWI SDA Hold Time Enable" mask="0x80" name="TWSHE"/>
                    <bitfield caption="TWI Data Interrupt Enable" mask="0x20" name="TWDIE"/>
                    <bitfield caption="TWI Address/Stop Interrupt Enable" mask="0x10" name="TWASIE"/>
                    <bitfield caption="Two-Wire Interface Enable" mask="0x08" name="TWEN"/>
                    <bitfield caption="TWI Stop Interrupt Enable" mask="0x04" name="TWSIE"/>
                    <bitfield caption="TWI Promiscuous Mode Enable" mask="0x02" name="TWPME"/>
                    <bitfield caption="TWI Smart Mode Enable" mask="0x01" name="TWSME"/>
                </register>
                <register caption="TWI Slave Control Register B" name="TWSCRB" offset="0xA4" size="1">
                    <bitfield caption="TWI High Noise Mode" mask="0x08" name="TWHNM"/>
                    <bitfield caption="TWI Acknowledge Action" mask="0x04" name="TWAA"/>
                    <bitfield caption="" mask="0x03" name="TWCMD"/>
                </register>
                <register caption="TWI Slave Status Register A" name="TWSSRA" offset="0xA3" size="1">
                    <bitfield caption="TWI Data Interrupt Flag." mask="0x80" name="TWDIF"/>
                    <bitfield caption="TWI Address/Stop Interrupt Flag" mask="0x40" name="TWASIF"/>
                    <bitfield caption="TWI Clock Hold" mask="0x20" name="TWCH"/>
                    <bitfield caption="TWI Receive Acknowledge" mask="0x10" name="TWRA"/>
                    <bitfield caption="TWI Collision" mask="0x08" name="TWC"/>
                    <bitfield caption="TWI Bus Error" mask="0x04" name="TWBE"/>
                    <bitfield caption="TWI Read/Write Direction" mask="0x02" name="TWDIR"/>
                    <bitfield caption="TWI Address or Stop" mask="0x01" name="TWAS"/>
                </register>
                <register caption="TWI Slave Address Register" name="TWSA" offset="0xA2" size="1" mask="0xFF" ocd-rw="R"/>
                <register caption="TWI Slave Data Register" name="TWSD" offset="0xA0" size="1" ocd-rw="R">
                    <bitfield caption="TWI slave data bit" mask="0xFF" name="TWSD"/>
                </register>
                <register caption="TWI Slave Address Mask Register" name="TWSAM" offset="0xA1" size="1">
                    <bitfield caption="TWI Address Mask Bits" mask="0xFE" name="TWSAM" lsb="1"/>
                    <bitfield caption="TWI Address Enable" mask="0x01" name="TWAE"/>
                </register>
            </register-group>
        </module>
        <module caption="Analog-to-Digital Converter" name="ADC">
            <register-group caption="Analog-to-Digital Converter" name="ADC">
                <register caption="The ADC multiplexer Selection Register A" name="ADMUXA" offset="0x29" size="1">
                    <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x3F" name="MUX"/>
                </register>
                <register caption="The ADC multiplexer Selection Register B" name="ADMUXB" offset="0x28" size="1">
                    <bitfield caption="Reference Selection Bits" mask="0xE0" name="REFS"/>
                    <bitfield caption="Gain Selection Bits" mask="0x03" name="GSEL"/>
                </register>
