bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY441.xml
                <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x25" size="1" ocd-rw="R">
                    <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
                    <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
                    <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
                    <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
                    <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
                    <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
                </register>
                <register caption="ADC Data Register Bytes" name="ADC" offset="0x26" size="2" mask="0xFFFF"/>
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x24" size="1">
                    <bitfield caption="" mask="0x08" name="ADLAR"/>
                    <bitfield caption="ADC Auto Trigger Sources" mask="0x07" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER_T841"/>
                </register>
                <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x61" size="1">
                    <bitfield caption="ADC9 Digital Input Disable" mask="0x08" name="ADC9D"/>
                    <bitfield caption="ADC8 Digital input Disable" mask="0x04" name="ADC8D"/>
                    <bitfield caption="ADC10 Digital input Disable" mask="0x02" name="ADC10D"/>
                    <bitfield caption="ADC11 Digital input Disable" mask="0x01" name="ADC11D"/>
                </register>
                <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x60" size="1">
                    <bitfield caption="ADC7 Digital input Disable" mask="0x80" name="ADC7D"/>
                    <bitfield caption="ADC6 Digital input Disable" mask="0x40" name="ADC6D"/>
                    <bitfield caption="ADC5 Digital input Disable" mask="0x20" name="ADC5D"/>
                    <bitfield caption="ADC4/AIN11 Digital input Disable" mask="0x10" name="ADC4D"/>
                    <bitfield caption="ADC3/AIN10 Digital Input Disable" mask="0x08" name="ADC3D"/>
                    <bitfield caption="ADC2/AIN01 Digital input Disable" mask="0x04" name="ADC2D"/>
                    <bitfield caption="ADC1/AIN00 Digital input Disable" mask="0x02" name="ADC1D"/>
                    <bitfield caption="ADC0/AREF Digital input Disable" mask="0x01" name="ADC0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_ADC_PRESCALER">
                <value caption="2" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER_T841">
                <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
                <value caption="Analog Comparator 0" name="VAL_0x01" value="0x01"/>
                <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
                <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
                <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
                <value caption="Timer/Counter1 Compare Match A" name="VAL_0x05" value="0x05"/>
                <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
                <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="Analog Comparator 0 Control And Status Register B" name="ACSR0B" offset="0x2B" size="1">
                    <bitfield caption="Analog Comparator 0 Hysteresis Select" mask="0x80" name="HSEL0"/>
                    <bitfield caption="Analog Comparator 0 Hysteresis Level" mask="0x40" name="HLEV0"/>
                    <bitfield caption="Analog Comparator 0 Output Pin Enable" mask="0x10" name="ACOE0"/>
                    <bitfield caption="Analog Comparator 0 Negative Input Multiplexer" mask="0x0C" name="ACNMUX"/>
                    <bitfield caption="Analog Comparator 0 Positive Input Multiplexer Bits 1:0" mask="0x03" name="ACPMUX"/>
                </register>
                <register caption="Analog Comparator 0 Control And Status Register A" name="ACSR0A" offset="0x2A" size="1">
                    <bitfield caption="Analog Comparator 0 Disable" mask="0x80" name="ACD0"/>
                    <bitfield caption="Analog Comparator 0 Positive Input Multiplexer Bit 2" mask="0x40" name="ACPMUX2"/>
                    <bitfield caption="Analog Comparator 0 Output" mask="0x20" name="ACO0"/>
                    <bitfield caption="Analog Comparator 0 Interrupt Flag" mask="0x10" name="ACI0"/>
                    <bitfield caption="Analog Comparator 0 Interrupt Enable" mask="0x08" name="ACIE0"/>
                    <bitfield caption="Analog Comparator 0 Input Capture Enable" mask="0x04" name="ACIC0"/>
                    <bitfield caption="Analog Comparator 0 Interrupt Mode Select bits" mask="0x03" name="ACIS0" values="ANALOG_COMP_INTERRUPT"/>
                </register>
                <register caption="Analog Comparator 1 Control And Status Register B" name="ACSR1B" offset="0x2D" size="1">
                    <bitfield caption="Analog Comparator 1 Hysteresis Select" mask="0x80" name="HSEL1"/>
                    <bitfield caption="Analog Comparator 1 Hysteresis Level" mask="0x40" name="HLEV1"/>
                    <bitfield caption="Analog Comparator 1 Output Pin Enable" mask="0x10" name="ACOE1"/>
                    <bitfield caption="Analog Comparator 1 Multiplexer Enable" mask="0x04" name="ACME1"/>
                </register>
