bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY441.xml
            <register-group caption="Timer/Counter, 16-bit" name="TC2">
                <register caption="Timer/Counter2 Interrupt Mask Register" name="TIMSK2" offset="0x31" size="1">
                    <bitfield caption="Timer/Counter2 Input Capture Interrupt Enable" mask="0x20" name="ICIE2"/>
                    <bitfield caption="Timer/Counter2 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE2B"/>
                    <bitfield caption="Timer/Counter2 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE2A"/>
                    <bitfield caption="Timer/Counter2 Overflow Interrupt Enable" mask="0x01" name="TOIE2"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag register" name="TIFR2" offset="0x30" size="1" ocd-rw="R">
                    <bitfield caption="Timer/Counter2 Input Capture Flag" mask="0x20" name="ICF2"/>
                    <bitfield caption="Timer/Counter2 Output Compare B Match Flag" mask="0x04" name="OCF2B"/>
                    <bitfield caption="Timer/Counter2 Output Compare A Match Flag" mask="0x02" name="OCF2A"/>
                    <bitfield caption="Timer/Counter2 Overflow Flag" mask="0x01" name="TOV2"/>
                </register>
                <register caption="Timer/Counter2 Control Register A" name="TCCR2A" offset="0xCA" size="1">
                    <bitfield caption="Compare Output Mode 2A, bits" mask="0xC0" name="COM2A"/>
                    <bitfield caption="Compare Output Mode 2B, bits" mask="0x30" name="COM2B"/>
                    <bitfield caption="Pulse Width Modulator Select Bits" mask="0x03" name="WGM2"/>
                </register>
                <register caption="Timer/Counter2 Control Register B" name="TCCR2B" offset="0xC9" size="1">
                    <bitfield caption="Input Capture 2 Noise Canceler" mask="0x80" name="ICNC2"/>
                    <bitfield caption="Input Capture 2 Edge Select" mask="0x40" name="ICES2"/>
                    <bitfield caption="Waveform Generation Mode Bits" mask="0x18" name="WGM2" lsb="2"/>
                    <bitfield caption="Clock Select bits" mask="0x07" name="CS2" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter2 Control Register C" name="TCCR2C" offset="0xC8" size="1" ocd-rw="">
                    <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC2A"/>
                    <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC2B"/>
                </register>
                <register caption="Timer/Counter2 Bytes" name="TCNT2" offset="0xC6" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter2 Output Compare Register A Bytes" name="OCR2A" offset="0xC4" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter2 Output Compare Register B Bytes" name="OCR2B" offset="0xC2" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter2 Input Capture Register Bytes" name="ICR2" offset="0xC0" size="2" mask="0xFFFF"/>
                <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/CounterN" mask="0x01" name="PSR"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit" name="TC8">
            <register-group caption="Timer/Counter, 8-bit" name="TC0">
                <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK0" offset="0x59" size="1">
                    <bitfield caption="Timer/Counter0 Output Compare Match B Interrupt Enable" mask="0x04" name="OCIE0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x02" name="OCIE0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
                </register>
                <register caption="Timer/Counter0 Interrupt Flag Register" name="TIFR0" offset="0x58" size="1" ocd-rw="R">
                    <bitfield caption="Timer/Counter0 Output Compare Flag B" mask="0x04" name="OCF0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Flag A" mask="0x02" name="OCF0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
                </register>
                <register caption="Timer/Counter Control Register A" name="TCCR0A" offset="0x50" size="1">
                    <bitfield caption="Compare Match Output A Mode bits" mask="0xC0" name="COM0A"/>
                    <bitfield caption="Compare Match Output B Mode bits" mask="0x30" name="COM0B"/>
                    <bitfield caption="Waveform Generation Mode bits" mask="0x03" name="WGM0"/>
                </register>
                <register caption="Timer/Counter Control Register B" name="TCCR0B" offset="0x53" size="1">
                    <bitfield caption="Force Output Compare A" mask="0x80" name="FOC0A"/>
                    <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
                    <bitfield caption="Waveform Generation Mode bit 2" mask="0x08" name="WGM02"/>
                    <bitfield caption="Clock Select bits" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter0" name="TCNT0" offset="0x52" size="1" mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register A" name="OCR0A" offset="0x56" size="1" mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register B" name="OCR0B" offset="0x5C" size="1" mask="0xFF"/>
