bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY441.xml
                <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/CounterN" mask="0x01" name="PSR"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Interrupt Sense Control 0 Bit 1" mask="0x02" name="ISC01"/>
                    <bitfield caption="Interrupt Sense Control 0 Bit 0" mask="0x01" name="ISC00" values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="General Interrupt Mask Register" name="GIMSK" offset="0x5B" size="1">
                    <bitfield caption="External Interrupt Request 0 Enable" mask="0x40" name="INT0"/>
                    <bitfield caption="Pin Change Interrupt Enables" mask="0x30" name="PCIE"/>
                </register>
                <register caption="General Interrupt Flag register" name="GIFR" offset="0x5A" size="1" ocd-rw="R">
                    <bitfield caption="External Interrupt Flag 0" mask="0x40" name="INTF0"/>
                    <bitfield caption="Pin Change Interrupt Flags" mask="0x30" name="PCIF"/>
                </register>
                <register caption="Pin Change Enable Mask 1" name="PCMSK1" offset="0x40" size="1" mask="0x0F">
                    <bitfield caption="Pin Change Enable Mask 1 Bit 0" mask="0x01" name="PCINT8"/>
                    <bitfield caption="Pin Change Enable Mask 1 Bit 1" mask="0x02" name="PCINT9"/>
                    <bitfield caption="Pin Change Enable Mask 1 Bit 2" mask="0x04" name="PCINT10"/>
                    <bitfield caption="Pin Change Enable Mask 1 Bit 3" mask="0x08" name="PCINT11"/>
                </register>
                <register caption="Pin Change Enable Mask 0" name="PCMSK0" offset="0x32" size="1" mask="0xFF">
                    <bitfield caption="Pin Change Enable Mask 0 Bit 0" mask="0x01" name="PCINT0"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 1" mask="0x02" name="PCINT1"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 2" mask="0x04" name="PCINT2"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 3" mask="0x08" name="PCINT3"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 4" mask="0x10" name="PCINT4"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 5" mask="0x20" name="PCINT5"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 6" mask="0x40" name="PCINT6"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 7" mask="0x80" name="PCINT7"/>
                </register>
            </register-group>
            <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Power Reduction Register" name="PRR" offset="0x70" size="1">
                    <bitfield caption="Power Reduction TWI" mask="0x80" name="PRTWI"/>
                    <bitfield caption="Power Reduction USART1" mask="0x40" name="PRUSART1"/>
                    <bitfield caption="Power Reduction USART0" mask="0x20" name="PRUSART0"/>
                    <bitfield caption="Power Reduction SPI" mask="0x10" name="PRSPI"/>
                    <bitfield caption="Power Reduction Timer/Counter2" mask="0x08" name="PRTIM2"/>
                    <bitfield caption="Power Reduction Timer/Counter1" mask="0x04" name="PRTIM1"/>
                    <bitfield caption="Power Reduction Timer/Counter0" mask="0x02" name="PRTIM0"/>
                    <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
                </register>
                <register caption="Configuration Change Protection" name="CCP" offset="0x71" size="1" mask="0xFF"/>
                <register caption="Clock Prescale Register" name="CLKPR" offset="0x73" size="1">
                    <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="Clock Control Register" name="CLKCR" offset="0x72" size="1">
                    <bitfield caption="Oscillator Ready" mask="0x80" name="OSCRDY"/>
                    <bitfield caption="Clock Switch Trigger" mask="0x40" name="CSTR"/>
                    <bitfield caption="Clock Output (Copy). Active low." mask="0x20" name="CKOUTC"/>
                    <bitfield caption="Start-up Time" mask="0x10" name="SUT"/>
                    <bitfield caption="Clock Select Bits" mask="0x0F" name="CKSEL"/>
                </register>
                <register caption="Status Register" name="SREG" offset="0x5F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
                <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0x07FF"/>
