bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY441.xml
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Sleep Enable" mask="0x20" name="SE"/>
                    <bitfield caption="Sleep Mode Select Bits" mask="0x18" name="SM" values="CPU_SLEEP_MODE"/>
                    <bitfield caption="Interrupt Sense Control 0 bits" mask="0x03" name="ISC0"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="General Purpose I/O Register 2" name="GPIOR2" offset="0x35" size="1" mask="0xFF"/>
                <register caption="General Purpose I/O Register 1" name="GPIOR1" offset="0x34" size="1" mask="0xFF"/>
                <register caption="General Purpose I/O Register 0" name="GPIOR0" offset="0x33" size="1" mask="0xFF"/>
                <register caption="Store Program Memory Control and Status Register" name="SPMCSR" offset="0x57" size="1" ocd-rw="R">
                    <bitfield caption="Read Device Signature Imprint Table" mask="0x20" name="RSIG"/>
                    <bitfield caption="Clear Temporary Page Buffer" mask="0x10" name="CTPB"/>
                    <bitfield caption="Read Fuse and Lock Bits" mask="0x08" name="RFLB"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
                <register caption="Oscillator Calibration Register 8MHz" name="OSCCAL0" offset="0x74" size="1" mask="0xFF"/>
                <register caption="Oscillator Calibration Register 32kHz" name="OSCCAL1" offset="0x77" size="1" mask="0x03"/>
                <register caption="Oscillator Temperature Calibration Register A" name="OSCTCAL0A" offset="0x75" size="1" mask="0xFF"/>
                <register caption="Oscillator Temperature Calibration Register B" name="OSCTCAL0B" offset="0x76" size="1" mask="0xFF"/>
            </register-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
                <value value="0x03" caption="32 kHz" name="32_kHz"/>
            </value-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Standby" name="STDBY" value="0x03"/>
            </value-group>
        </module>
        <module caption="Timer/Counter Output Compare Pin" name="TOCPM">
            <register-group caption="Timer/Counter Output Compare Pin" name="TOCPM">
                <register caption="Timer Output Compare Pin Mux Selection 1" name="TOCPMSA1" offset="0x68" size="1">
                    <bitfield caption="Timer Output Compare Channel 7 Selection Bits" mask="0xC0" name="TOCC7S"/>
                    <bitfield caption="Timer Output Compare Channel 6 Selection Bits" mask="0x30" name="TOCC6S"/>
                    <bitfield caption="Timer Output Compare Channel 5 Selection Bits" mask="0x0C" name="TOCC5S"/>
                    <bitfield caption="Timer Output Compare Channel 4 Selection Bits" mask="0x03" name="TOCC4S"/>
                </register>
                <register caption="Timer Output Compare Pin Mux Selection 0" name="TOCPMSA0" offset="0x67" size="1">
                    <bitfield caption="Timer Output Compare Channel 3 Selection Bits" mask="0xC0" name="TOCC3S"/>
                    <bitfield caption="Timer Output Compare Channel 2 Selection Bits" mask="0x30" name="TOCC2S"/>
                    <bitfield caption="Timer Output Compare Channel 1 Selection Bits" mask="0x0C" name="TOCC1S"/>
                    <bitfield caption="Timer Output Compare Channel 0 Selection Bits" mask="0x03" name="TOCC0S"/>
                </register>
                <register caption="Timer Output Compare Pin Mux Channel Output Enable" name="TOCPMCOE" offset="0x66" size="1">
                    <bitfield caption="Timer Output Compare Channel 7 Output Enable" mask="0x80" name="TOCC7OE"/>
                    <bitfield caption="Timer Output Compare Channel 6 Output Enable" mask="0x40" name="TOCC6OE"/>
                    <bitfield caption="Timer Output Compare Channel 5 Output Enable" mask="0x20" name="TOCC5OE"/>
                    <bitfield caption="Timer Output Compare Channel 4 Output Enable" mask="0x10" name="TOCC4OE"/>
                    <bitfield caption="Timer Output Compare Channel 3 Output Enable" mask="0x08" name="TOCC3OE"/>
                    <bitfield caption="Timer Output Compare Channel 2 Output Enable" mask="0x04" name="TOCC2OE"/>
                    <bitfield caption="Timer Output Compare Channel 1 Output Enable" mask="0x02" name="TOCC1OE"/>
                    <bitfield caption="Timer Output Compare Channel 0 Output Enable" mask="0x01" name="TOCC0OE"/>
                </register>
            </register-group>
        </module>
