bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY441.xml
        <module caption="Serial Peripheral Interface" name="SPI">
            <register-group caption="Serial Peripheral Interface" name="SPI">
                <register caption="SPI Control Register" name="SPCR" offset="0xB2" size="1">
                    <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
                    <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
                    <bitfield caption="Data Order" mask="0x20" name="DORD"/>
                    <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
                    <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
                    <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
                    <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE"/>
                </register>
                <register caption="SPI Status Register" name="SPSR" offset="0xB1" size="1">
                    <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
                    <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
                    <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
                </register>
                <register caption="SPI Data Register" name="SPDR" offset="0xB0" size="1" mask="0xFF"/>
                <register caption="Remap Port Pins" name="REMAP" offset="0x65" size="1">
                    <bitfield caption="SPI Pin Mapping" mask="0x02" name="SPIMAP"/>
                </register>
            </register-group>
            <value-group caption="" name="COMM_SCK_RATE">
                <value caption="fcl/4" name="VAL_0x00" value="0x00"/>
                <value caption="fcl/16" name="VAL_0x01" value="0x01"/>
                <value caption="fcl/64" name="VAL_0x02" value="0x02"/>
                <value caption="fcl/128" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="SOIC_14">
            <pin pad="GND" position="14"/>
            <pin pad="PA0" position="13"/>
            <pin pad="PA1" position="12"/>
            <pin pad="PA2" position="11"/>
            <pin pad="PA3" position="10"/>
            <pin pad="PA4" position="9"/>
            <pin pad="PA5" position="8"/>
            <pin pad="PA6" position="7"/>
            <pin pad="PA7" position="6"/>
            <pin pad="PB2" position="5"/>
            <pin pad="PB3" position="4"/>
            <pin pad="PB1" position="3"/>
            <pin pad="PB0" position="2"/>
            <pin pad="VCC" position="1"/>
        </pinout>
        <pinout name="QFN_20">
            <pin pad="PA4" position="1"/>
            <pin pad="PA3" position="2"/>
            <pin pad="PA2" position="3"/>
            <pin pad="PA1" position="4"/>
            <pin pad="PA0" position="5"/>
            <pin pad="NC" position="6"/>
            <pin pad="NC" position="7"/>
            <pin pad="GND" position="8"/>
            <pin pad="VCC" position="9"/>
            <pin pad="NC" position="10"/>
            <pin pad="PB0" position="11"/>
            <pin pad="PB1" position="12"/>
            <pin pad="PB3" position="13"/>
            <pin pad="PB2" position="14"/>
            <pin pad="PA7" position="15"/>
            <pin pad="PA6" position="16"/>
            <pin pad="NC" position="17"/>
            <pin pad="NC" position="18"/>
            <pin pad="NC" position="19"/>
            <pin pad="PA5" position="20"/>
        </pinout>
    </pinouts>
</target-description-file>
